Repository: ccprog/crosswordsearch
Catalog: plugin/languages/crosswordsearch-*.po
Languages: pt_pt

source: Riddle...
pt_pt: Enigma...

source: Describe which words should be found:
pt_pt: Descreve que palavras devem ser encontradas:

source: Dont't try to be clever!
pt_pt: Não te armes em chico esperto!

source: Select a difficulty level:
pt_pt: Selecciona um nível de dificuldade:

source: Select a riddle
pt_pt: Selecciona um enigma

source: Find these words in the riddle:
pt_pt: Encontra estas palavras no enigma:

source: Difficulty level
pt_pt: Nível de dificuldade

source: Word directions
pt_pt: Direcções da palavra.

source: only to the right and down
pt_pt: apenas para a direita e para baixo

source: any, including diagonal and backwards
pt_pt: qualquer, incluindo diagonal e para trás

source: List of words that should be found
pt_pt: Lista de palavras que devem ser encontradas

source: visible before found
pt_pt: Visível antes de encontrado

source: hidden before found
pt_pt: oculto antes encontrado

source: Fill in the the letters and mark the words:
pt_pt: Preencha as letras e marque as palavras:

source: Mark the words:
pt_pt: Selecciona as palavras:

source: Start
pt_pt: Começa

source: Start solving the riddle
pt_pt: Começa a resolver o enigma

source: Time
pt_pt: Tempo

source: Restart
pt_pt: Recomeçar

source: Restart solving the riddle
pt_pt: Recomeçar a resolver o enigma

source: Result
pt_pt: Resultado

source: Remaining time
pt_pt: Tempo restante

source: Time used
pt_pt: Tempo utilizado

source: Drag to move the border of the riddle
pt_pt: Arraste para mover a borda do enigma

source: Fill all empty fields with random letters
pt_pt: Preencha todos os campos vazios com letras aleatórias

source: Fill fields
pt_pt: Preenche os campos

source: Empty all fields
pt_pt: Esvaziar todos os campos

source: Empty
pt_pt: Esvaziar

source: from line %1$s, column %2$s %3$s
pt_pt: da linha %1$s, coluna %2$s %3$s

source: Delete
pt_pt: Eliminar

source: You have found %1$s of %2$s words
pt_pt: Encontraste %1$s de %2$s palavras

source: You have found all %1$s words!
pt_pt: Encontraste todas as %1$s palavras!

source: Authored by
pt_pt: Autoria de

source: CRW Riddle
pt_pt: CRW enigma

source: Solved Crosswordsearch Riddles
pt_pt: Enigma resolvido.

source: CRW Riddles
pt_pt: CRW enigmas

source: Crosswordsearch Submission (Reviewed)
pt_pt: Submissões de palavras cruzadas (Revistas)

source: Crosswordsearch Submission (Auto-accepted)
pt_pt: Submissões de palavras cruzadas (Auto-aceites)

source: Crosswordsearch Submission Rules
pt_pt: Regras de submissão das palavras cruzadas

source: Review Method:
pt_pt: Método de revisão:

source: Should the submisson be reviewed manually?
pt_pt: A submissão deve ser revista manualmente?

source: manually
pt_pt: manualmente

source: rule-based
pt_pt: baseado em regras

source: Rules
pt_pt: Regras

source: Submissions shall be accepted based on the following rules:
pt_pt: As submissões serão aceites com base nas seguintes regras:

source: Solved completely
pt_pt: Completamente resolvido

source: The riddle must be solved completely.
pt_pt: O enigma tem de ser completamente resolvido.

source: Minimum word count
pt_pt: Contagem mínima de palavras

source: The minimum number of words that must be found. Does not apply if the riddle must be solved completely.
pt_pt: O limite mínimo de palavras que têm de ser encontradas não se aplica se o enigma tiver que ser resolvido na integra.

source: Submission saved successfully.
pt_pt: Submissão guardada com sucesso.

source: You have not earned this achievement.
pt_pt: Ainda não conquistaste este objectivo.

source: User submitted solutions for crosswordsearch riddles
pt_pt: As tuas respostas submetidas para os enigmas das palavras cruzadas

source: Empty Crossword
pt_pt: Esvaziar as Palavras Cruzadas

source: First crossword
pt_pt: Primeiras palavras cruzadas

source: Choose from all
pt_pt: Escolha entre todos

source: Insert a Crosswordsearch shortcode
pt_pt: Inserir shortcode de palavras cruzadas

source: Crosswordsearch Shortcode
pt_pt: Shortcode de palavras cruzadas

source: The shortcode usage is faulty:
pt_pt: O uso do shortcode está com defeito:

source: Attribute %1$s needs to be set to one of "%2$s" or "%3$s".
pt_pt: O atributo %1$s precisa ser definido como "%2$s" ou "%3$s".

source: If attribute %1$s is set, attribute %2$s must be omitted.
pt_pt: Se o atributo %1$s estiver definido, o atributo %2$s deve ser omitido.

source: Attribute %1$s is only allowed in solve mode.
pt_pt: O atributo %1$s só é permitido no modo de resolução.

source: Attribute %1$s must be a non-negative integer.
pt_pt: O atributo %1$s deve ser um inteiro não negativo.

source: If attribute %1$s is set, attribute %2$s must also be set.
pt_pt: Se o atributo %1$s estiver definido, o atributo %2$s também deve ser definido.

source: Attribute %1$s needs to be an existing project.
pt_pt: O atributo %1$s precisa de ser um projecto existente.

source: There is no crossword in project %1$s.
pt_pt: Não há palavras cruzadas no projecto %1$s.

source: There is no crossword with the name %1$s.
pt_pt: Não há palavras cruzadas com o nome %1$s.

source: Do you want to submit your result?
pt_pt: Queres submeter o teu resultado?

source: Loading the crossword has yet to start.
pt_pt: Carregamento das palavras cruzadas ainda não iniciado.

source: You do not have permission.
pt_pt: Não tens permissão.

source: There are still riddles saved for that project. You need to delete them before you can remove the project.
pt_pt: Ainda existem enigmas guardados nesse projecto. Precisas de os eliminar antes de conseguires remover o projecto.

source: Editing rights could not be updated.
pt_pt: Os direitos de edição não puderam ser actualizados.

source: Dimensions could not be updated.
pt_pt: Não foi possível actualizar as dimensões

source: Subscription options could not be updated.
pt_pt: Não foi possível actualizar as opções de subscrição.

source: The project could not be removed.
pt_pt: Não foi possível remover o projecto.

source: You have exceeded the maximum length for a name!
pt_pt: Excedeste o comprimento máximo permitido para um nome!

source: The name is too short!
pt_pt: O nome é demasiado curto!

source: The project could not be added.
pt_pt: Não foi possível adicionar o projecto.

source: The project could not be altered.
pt_pt: Não foi possível alterar o projecto.

source: The editors could not be updated.
pt_pt: Não foi possível actualizar os editores.

source: The crossword could not be deleted.
pt_pt: Não foi possível apagar as palavras cruzadas.

source: The crossword could not be approved.
pt_pt: Não foi possível aprovar as palavras cruzadas.

source: You are not allowed to save the crossword.
pt_pt: Não tens permissão para guardar estas palavras cruzadas.

source: There is already another riddle with that name!
pt_pt: Já existe outro enigma com esse nome!

source: The riddle you tried to update can not be found!
pt_pt: O enigma que tentaste actualizar não foi encontrado!

source: A moderator might have deleted it already. You must start a new one.
pt_pt: Um moderador poderá já tê-lo eliminado entretanto. Tens de começar de novo.

source: Someone else might have renamed or deleted it in the meantime. Look into the list of existing riddles.
pt_pt: Alguém deve ter renomeado ou eliminado o que procuras. Experimenta ver a lista de enigmas existentes.

source: The crossword could not be saved to the database.
pt_pt: Não foi possível salvaguardar as palavras cruzadas no banco de dados.

source: The crossword could not be retrieved.
pt_pt: Não foi possível recuperar as palavras cruzadas.

source: Solution submitted for crossword %1$s in project %2$s:
pt_pt: Solução enviada para palavras cruzadas %1$s no projecto %2$s:

source: %1$s of %2$s words were found in %3$s seconds.
pt_pt: %1$s em %2$s palavras foram encontradas em %3$s segundos.

source: All %1$s words were found in %2$s seconds.
pt_pt: Todas as palavras %1$s foram encontradas em %2$s segundos.

source: Your solution could not be submitted.
pt_pt: A tua resposta não foi submetida.

source: Options
pt_pt: Opções

source: Riddles saved by restricted editors need the approval of full editors before they can appear for other users.
pt_pt: Enigmas salvos por editores restritos precisam da aprovação de todos os editores antes de poderem estar visíveis para outro utilizadores.

source: Full editors can only act on the projects they are assigned to.
pt_pt: Editores completos só podem actuar nos projectos aos quais estão designados.

source: For custom theming, place a file %1$s with overrides to the default theme into your theme folder.
pt_pt: Para temas personalizados, coloque um arquivo %1$s com substituições no tema padrão na pasta do tema.

source: There are some dimension values that are used in computations during drag operations. If you have a custom theme, you might have to additionally adjust these values.
pt_pt: Existem alguns valores de dimensões que são utilizados nos cálculos durante as operações de arraste. Se estás a utilizar um tema personalizado, é possível que tenhas de ajustar estes valores.

source: Dimension settings are pixel values and used uniformly for heights and widths.
pt_pt: As configurações de dimensão são valores de pixel e usadas uniformemente para alturas e larguras.

source: Solution submissions can either be processed by one of the plugins listed below, or another plugin can subscribe to them through the API.
pt_pt: As soluções submetidas podem ser processadas por um dos plugins listados abaixo, ou por outro plugin que terás de subscrever por meio da API.

source: Projects
pt_pt: Projectos

source: If you change the name of a project, remember that you need to change it also in every shortcode referring to it.
pt_pt: Se você alterar o nome de um projecto, lembre-se de que é preciso alterá-lo também em cada código de acesso que se refira a ele.

source: The lowest eligible maximum difficulty level is either the the default level or the highest level used in an existing riddle, whatever is higher.
pt_pt: O menor nível de dificuldade máxima elegível é ou nível padrão ou o nível mais alto usado em um enigma existente, conforme o que for maior.

source: You need to assign editors to a project in order for them to see its riddles in the <em>Review</em> tab.
pt_pt: Precisas de destacar editores para um projecto se queres que eles vejam o enigma no separador <em>Review</em>.

source: If you want to delete a project, you need first to delete all its riddles.
pt_pt: Se desejas excluir um projecto, primeiro é necessário excluires todos os seus enigmas.

source: Review
pt_pt: Revisão

source: To preview a riddle, check the <em>Preview</em> box and then click on the name of the riddle
pt_pt: Para pré-visualizares um enigma, tens de verificar a secção <em>Pré-visualizar</em> e clicar no nome do enigma

source: Crosswordsearch Administration
pt_pt: Administração das palavras cruzadas

source: You need to hit your browser's Reload button.
pt_pt: Precisas de recarregar esta página.

source: You can find information about data collected by plugin Crosswordsearch at the following address:
pt_pt: Podes encontrar informação sobre os dados colectados pelo plugin Crosswordsearch no seguinte adereço:

source: (Last updated on %s.)
pt_pt: (Última actualização em %s.)

source: It is recomended not to link to it, but to include the relevant information in your privacy policy text.
pt_pt: Recomenda-se que não vincule, mas pode incluir as informações relevantes no texto da sua política de privacidade.

source: Editor for project
pt_pt: Editor para o projecto

source: Crosswordsearch editing rights
pt_pt: Direitos de edição das palavras cruzadas

source: original author
pt_pt: autor original

source: last editor
pt_pt: último editor

source: Project
pt_pt: Projecto

source: Crossword name
pt_pt: Nome das palavras cruzadas

source: Edited as
pt_pt: Editado como

source: and
pt_pt: e

source: Crossword content
pt_pt: Conteúdo das palavras cruzadas

source: Crosswordsearch authorship
pt_pt: Autoria das palavras cruzadas

source: The user was listed as last editor of crossword "%s" in project "%s", but was not the original author.
pt_pt: O utilizador foi listado como o último editor das palavras cruzadas "%s" no projecto "%s", mas não foi o seu autor original.

source: The crossword was retained, now citing the original author as the last editor.
pt_pt: As palavras cruzadas foram mantidas, agora citando o autor original como o último editor.

source: The user was listed as original author of crossword "%s" in project "%s", but was not the last editor.
pt_pt: O utilizador foi listado como autor original das palavras cruzadas "%s" no projecto "%s", mas não foi o seu último editor.

source: The crossword was retained, now citing the last editor as the original author.
pt_pt: As palavras cruzadas foram mantidas, agora citando o último editor como o autor original.

source: Project Name
pt_pt: Nome do projecto

source: You must give a name!
pt_pt: Tens de escrever um nome!

source: There is already another project with that name!
pt_pt: Já existe outro projecto com esse nome!

source: Default difficulty level
pt_pt: Dificuldade padrão

source: Maximum difficulty level
pt_pt: Nível máximo de dificuldade

source: Save the project
pt_pt: Guardar o projecto

source: Save
pt_pt: Guardar

source: Abort saving the project
pt_pt: Abordar salvamento do projecto

source: Abort
pt_pt: Abortar

source: Full project editors
pt_pt: Editores completos do projecto

source: Other users with full editor rights
pt_pt: Outros utilizadores com direitos completos de editor

source: Add all users to the editors of the marked project
pt_pt: Adicione todos os utilizadores aos editores do projecto destacado

source: Add the marked user to the editors of the marked project
pt_pt: Adicione o utilizador seleccionado aos editores do projecto destacado

source: Remove the marked user from the editors of the marked project
pt_pt: Remova o utilizador destacado dos editores do projecto seleccionado

source: Remove all users from the editors of the marked project
pt_pt: Remover todos os utilizadores dos editores do projecto selecionado

source: Add a new project
pt_pt: Adicionar um novo projecto

source: Delete the selected project
pt_pt: Eliminar o projecto selecionado

source: Save the editor list for this project
pt_pt: Guardar a lista de editores para este projecto

source: Abort saving the editor list
pt_pt: Abortar salvamento da lista de editores

source: To save it, you must give the riddle a new name.
pt_pt: Para guardares este enigma, tens de dar-lhe um novo nome.

source: You can change the additional informations that are saved about the riddle.
pt_pt: Podes alterar as informações adicionais que foram guardadas neste enigma.

source: Name:
pt_pt: Nome:

source: That looks good!
pt_pt: Parece bem!

source: Author:
pt_pt: Autor:

source: You have found %1$s of %2$s hidden words during the alloted time.
pt_pt: Durante o tempo atribuído encontraste %1$s das %2$s palavras escondidas.

source: Congratulation, you have solved the riddle in %1$s!
pt_pt: Parabéns, conseguiste resolver o enigma em %1$s!

source: Username:
pt_pt: Nome de utilizador:

source: Password:
pt_pt: Palavra-chave:

source: A username and password is required for saving!
pt_pt: São necessários um nome de utilizador e uma palavra-chave para guardar.

source: Submit
pt_pt: Submeter

source: Loading...
pt_pt: Carregando...

source: The marked word no longer fits into the crossword area. For a successful resize you must delete this word.
pt_pt: A palavra destacada não cabe na área das palavras cruzadas. Para um reajuste bem sucedido, tens de eliminar esta palavra.

source: The marked words no longer fit into the crossword area. For a successful resize you must delete these words.
pt_pt: As palavras destacadas não cabem na área das palavras cruzadas. Para um reajuste bem sucedido, tens de eliminar algumas palavras.

source: The marked word goes into a direction that is excluded for difficulty level %1$s. For a successful level change you must delete this word.
pt_pt: A palavra destacada apresenta-se numa direcção que não é permitida para o nível de dificuldade %1$s. Para uma mudança de nível bem sucedida, tens de eliminar esta palavra.

source: The marked words go into directions that are excluded for difficulty level %1$s. For a successful level change you must delete these words.
pt_pt: As palavras destacadas vão em direcções não permitidas para o nível de dificuldade %1$s. Para uma mudança de nível bem sucedida, tens de eliminar essas palavras.

source: The marked word %1$s is not part of the solution.
pt_pt: A palavra %1$s destacada, não faz parte da solução.

source: Congratulation, you have solved the riddle!
pt_pt: Parabéns, conseguiste resolver o enigma!

source: Do you really want to do this?
pt_pt: Tens a certeza que queres fazer isto?

source: Delete project %1$s
pt_pt: Eliminar o projecto %1$s

source: Delete crossword %1$s from project %2$s
pt_pt: Eliminar as palavras cruzadas %1$s do projecto %2$s

source: Approve crossword %1$s for project %2$s
pt_pt: Aprovar palavras cruzadas %1$s para o projecto %2$s

source: Please be patient for the crossword being loaded.
pt_pt: Por favor, seja paciente enquanto as palavras cruzadas são carregadas.

source: down and right
pt_pt: para baixo e para a direita

source: up and left
pt_pt: cima e esquerda

source: up and right
pt_pt: cima e direita

source: down and left
pt_pt: para baixo e para a esquerda

source: down
pt_pt: baixo

source: up
pt_pt: cima

source: to the right
pt_pt: para a direita

source: to the left
pt_pt: para a esquerda

source: New
pt_pt: Novo

source: Start a completely new riddle
pt_pt: Começa um enigma completamente novo

source: Load
pt_pt: Carregar

source: Load an existing riddle
pt_pt: Carregar um enigma existente

source: Save...
pt_pt: Guardar...

source: Save your work on the riddle
pt_pt: Guardar o teu trabalho no enigma

source: Save as...
pt_pt: Guardar como...

source: Save as a new riddle with a seperate name
pt_pt: Guardar como um novo enigma com um nome separado

source: Reload
pt_pt: Recarregar

source: Reset to the saved version
pt_pt: Redefinir para a última versão guardada

source: black
pt_pt: preto

source: red
pt_pt: vermelho

source: green
pt_pt: verde

source: blue
pt_pt: azul

source: orange
pt_pt: laranja

source: violet
pt_pt: violeta

source: aqua
pt_pt: àgua

source: grey
pt_pt: cinzento

source: Editing rights
pt_pt: Direitos de edição

source: Roles
pt_pt: Papeis

source: none
pt_pt: nenhum

source: restricted
pt_pt: restrito

source: full
pt_pt: completo

source: Save the updated assignment of editing capabilities
pt_pt: Guardar a atribuição actualizada de recursos de edição

source: Dimensions of the table grid
pt_pt: Dimensões da grade da mesa

source: Do not change this without reviewing your CSS!
pt_pt: Não mudes isto sem rever o teu CSS!

source: Illustration of grid dimensions
pt_pt: Dimensões da grelha de ilustração

source: Outer border size
pt_pt: Tamanho da borda exterior

source: Field size without borders
pt_pt: Tamanho do campo sem bordas

source: Border size between adjecent fields
pt_pt: Tamanho da borda entre campos adjacentes

source: Size of the drag handle outside the grid borders
pt_pt: Tamanho da alça de arrasto fora das bordas da grade

source: Size of the drag handle inside the grid borders
pt_pt: Tamanho da alça de arrasto dentro das bordas da grade

source: Each dimension needs to be an integer of 0 or more
pt_pt: Cada dimensão precisa ter um inteiro de 0 ou mais

source: Save the updated grid dimensions
pt_pt: Guardar as dimensões da grelha actualizadas

source: These settings are only available if you use a custom stylesheet
pt_pt: Estas configurações só estão disponíveis se utilizares uma folha de estilo personalizada.

source: Solution submissions
pt_pt: Soluções submetidas

source: Install and activate a plugin to submit a solution to it.
pt_pt: Instala e activa o plugin para submeter a solução.

source: Log submissions with:
pt_pt: Registo de submissões com:

source: Save the submission targets
pt_pt: Guardar os alvos de submissão.

source: Approved crosswords
pt_pt: Palavras cruzadas aprovadas

source: Crosswords pending approval
pt_pt: Palavras cruzadas pendentes de aprovação

source: Approve the marked crossword to be displayed for everyone
pt_pt: Aprovar as palavras cruzadas seleccionadas a serem exibidas para todos

source: Delete the selected approved crossword
pt_pt: Eliminar as palavras cruzadas aprovadas seleccionadas

source: Delete the selected pending crossword
pt_pt: Eliminar as palavras cruzadas seleccionadas pendentes

source: Show a preview of the selected crossword
pt_pt: Mostrar uma pré-visualização da palavra cruzada selecionada

source: Preview
pt_pt: Pré-visualisar

source: Assign projects and editors
pt_pt: Atribuir projetos e editores

source: Review riddles in projects
pt_pt: Revê os enigmas nos projectos

source: Crosswordsearch submissions
pt_pt: Submissões de palavras cruzadas

source: Waiting for data...
pt_pt: A aguardar dados...

source: No projects found.
pt_pt: Nenhum projecto foi encontrado.

source: Mode
pt_pt: Modo

source: Design crosswords
pt_pt: Desenhar palavras cruzadas

source: Solve crosswords
pt_pt: Resolve as palavras cruzadas

source: Select something.
pt_pt: Selecciona algo

source: Crossword
pt_pt: Palavras cruzadas

source: Select one or let the user choose from all crosswords.
pt_pt: Selecciona uma das palavras cruzadas ou deixa à escolha do utilizador.

source: Preselect the crossword initially displayed. All crosswords remain selectable.
pt_pt: Pré-selecione as palavras cruzadas exibidas inicialmente. Todas as palavras cruzadas permanecem seleccionáveis.

source: Save opportunities
pt_pt: Guardar oportunidades

source: Restricted
pt_pt: Restrito

source: Uploads by restricted users must be reviewed.
pt_pt: Os uploads do utilizadores restritos têm de ser revistos.

source: Display timer
pt_pt: Exibir o temporizador

source: None
pt_pt: Nenhum

source: Open-ended
pt_pt: Aberta

source: Countdown
pt_pt: Contagem regressiva

source: Allowed time
pt_pt: Tempo permitido

source: Give time in seconds (a positive integer).
pt_pt: Dar o tempo em segundos (um número inteiro positivo).

source: Submission
pt_pt: Submissão

source: Let users submit their result
pt_pt: Deixa os utilizadores submeterem os seus resultados

source: Insert Shortcode
pt_pt: Inserir shortcode

source: Cancel
pt_pt: Cancelar

source: Define how a Crosswordsearch block should be displayed
pt_pt: Definir como o é que o bloco do Crosswordsearch deve ser exibido

source: Crosswordsearch has no visual preview.
pt_pt: Sem pré-visualização para Crosswordsearch.

source: Its representation as a "shortcode" is, for now, a way to ease the transition from the classic editor to Gutenberg.
pt_pt: A representação de "shortcode" é por agora uma forma de faciltar a transição entre o editor clássico e o Gutenberg.
